{
    "basic_info": {
      "description_header": "Hi",
      "description": "Hello there, I'm Alfredo Orquiz. I'm a Software Engineer with a military background in aviation mechanics. I am working on learning and mastering new coding languages. So far, the languages I am familiar with are HTML, CSS, JavaScript, and React. My goal is to become a full stack software engineer to work on designing websites from scratch, improve existing websites, and work in the robotics industry. I invite you to review my profile template to get to know me better.",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "Guess the rainbow",
        "startDate": "July 2022",
        "description": "School project where we implemented our knowledge, showed the results of our training and learned how to work as a team. The website was created by Rhea, Brooke, and I, inspired by a kid named Brooke. We created a kid version of Wordle, where we have colors instead of words. You have a certain amount of guesses where you have to guess the order of the colors. The colors don’t repeat themselves in order, so you can have a chance at winning the game. It will have a red border to let you know that the color is not in the order and a yellow border to indicate that it is in the order, just in the wrong order. A green border to show that it is in the order and in the correct order.",
        "images": [
          "images/portfolio/Guess the rainbow/Guess the rainbow Main Page.png",
          "images/portfolio/Guess the rainbow/Guess the rainbow Winning.png"
        ],
        "url": "",
        "technologies": [
          {
            "class": "devicon-angularjs-plain",
            "name": "Angular"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "TypeScript"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          }
        ]
      },
      {
        "title": "Odd Duck",
        "startDate": "July 2022",
        "description": "School project where we learned how to implement graphs, got more training on CSS, and learned about local storage. The website renders several photos, where customers can click and vote for their favorite images. After a certain number of votes, where the photos can’t repeat itself twice in a row, or repeat in the same row, the graph will render the number of views each image got and how many votes it got in total.",
        "images": [
          "images/portfolio/Odd duck/Odd Duck.png",
          "images/portfolio/Odd duck/Odd Duck Results.png"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          }
        ]
      },
      {
        "title": "Salmon Cookies",
        "startDate": "July 2022",
        "description": "One of the first websites I was working on in school where I first learned about JavaScript. I had to develop front-end implementation for app that took in information to add a new city, minimum and maximum number of customers, and average cookies sold. This was also my first project in JavaScript, and I struggled a lot, but also learned a lot more.",
        "images": [
          "images/portfolio/Salmon Cookies/Salmon Cookies.png",
          "images/portfolio/Salmon Cookies/Salmon Cookies Results.png"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-angularjs-plain",
            "name": "Angular"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "TypeScript"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "DefOpenSource",
        "title": "Front-End Developer",
        "years": "10.2019 - present",
        "mainTech": [
          "Angular 8/9/10"
        ],
        "technologies": [
          "REST API",
          "RxJS",
          "JavaScript",
          "Bootstrap",
          "MDBootstrap",
          "EF Core",
          ".NET Core",
          "SignalR",
          "Angular Material"
        ]
      },
      {
        "company": "Serros Solutions",
        "title": "Intern",
        "years": "01.2018 - 09.2019",
        "mainTech": [
          "Angular 7/8"
        ],
        "technologies": [
          "RxJS",
          "Django",
          "PHP",
          "JavaScript",
          "DHTMLX Gantt"
        ]
      }
    ]
  }
